app/controllers/colleges_controller.rb

    def set_college
      @college = College.find(params[:id])
---
SELECT  "colleges".* FROM "colleges" WHERE "colleges"."id" = ? LIMIT 1  [["id", 3]]