app/controllers/landing_page_controller.rb

SELECT "colleges".* FROM "colleges"
---
  def set_colleges
  	@all_colleges = College.all