app/controllers/student_verification_controller.rb

SELECT "colleges".* FROM "colleges" WHERE "colleges"."id" = ?  [["id", nil]]
INSERT INTO "verification_requests" ("student_id", "college_id", "name", "hallticket_no", "document_link", "amount", "verification_status_id", "service_tax", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
SELECT "colleges"."verification_amount" FROM "colleges" WHERE "colleges"."id" = ?  [["id", 1]]
---
	def add_verification
		@verification_request = VerificationRequest.new(verification_params)
		@college_ver = College.where(:id => @verification_request.college_id).first
		@verification_request.amount = @college_ver.verification_amount
		@verification_request.verification_status_id = 1
		@verification_request.service_tax = ENV['DEFAULT_VERF_AMOUNT'].to_f * (1 + ENV['TAX_PERCENT'].to_f / 100)

	    # respond_to do |format|
	      if @verification_request.save
	        # format.html { redirect_to @verification_request, notice: 'Student was successfully created.' }
	        url = HTTParty.get("#{ENV['MVAAYOO_URL']}?user=#{ENV['MVAAYOO_USER']}:#{ENV['MVAAYOO_PASSWORD']}&senderID=TEST%20SMS&receipientno=#{@college_ver.user.phone}&msgtxt=New verification for #{@college_ver.name}. Name: #{@verification_request.name}. Hallticket: #{@verification_request.hallticket_no}&state=4")